apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    if (txrx == BLE_PHY_WFR_ENABLE_TXRX || txrx == BLE_PHY_WFR_ENABLE_RXRX) {
        /* Wait a bit longer due to allowed active clock accuracy */
        end_time += 2;
        /*
         * It's possible that we'll capture PDU start time at the end of timer
         * cycle and since wfr expires at the beginning of calculated timer
         * cycle it can be almost 1 usec too early. Let's compensate for this
         * by waiting 1 usec more.
         */
        end_time += 1;

        end_time += MYNEWT_VAL(BLE_PHY_EXTENDED_TIFS);
    }

    if (g_ble_phy_data.phy_feature_mode == PHY_FEAT_MODE_BLE_LL
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
        || g_ble_phy_data.phy_feature_mode == PHY_FEAT_MODE_BLE_CS_SYNC
#endif
        ) {
        /*
         * Note: on LE Coded EVENT_ADDRESS is fired after TERM1 is received, so
         *       we are actually calculating relative to start of packet payload
         *       which is fine.
         */

        /* Adjust for receiving access address since this triggers EVENT_ADDRESS */
        end_time += ble_phy_mode_pdu_start_off(phy);
        /* Adjust for delay between actual access address RX and EVENT_ADDRESS */
        end_time += g_ble_phy_t_rxaddrdelay[phy];
    }

    /* wfr_secs is the time from rxen until timeout */
    nrf_timer_cc_set(NRF_TIMER0, 3, end_time);
    NRF_TIMER0->EVENTS_COMPARE[3] = 0;

    /* Enable wait for response PPI */
    phy_ppi_wfr_enable();

    /*
     * It may happen that if CPU is halted for a brief moment (e.g. during flash
     * erase or write), TIMER0 already counted past CC[3] and thus wfr will not
     * fire as expected. In case this happened, let's just disable PPIs for wfr
     * and trigger wfr manually (i.e. disable radio).
     *
     * Note that the same applies to RX start time set in CC[0] but since it
     * should fire earlier than wfr, fixing wfr is enough.
     *
     * CC[1] is only used as a reference on RX start, we do not need it here so
     * it can be used to read TIMER0 counter.
     */
    nrf_timer_task_trigger(NRF_TIMER0, NRF_TIMER_TASK_CAPTURE1);
    if (NRF_TIMER0->CC[1] > NRF_TIMER0->CC[3]) {
        phy_ppi_wfr_disable();
        nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
    }
}

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
static uint32_t
ble_phy_get_ccm_datarate(void)
{
#if MYNEWT_VAL(BLE_LL_PHY)
    switch (g_ble_phy_data.phy_cur_phy_mode) {
    case BLE_PHY_MODE_1M:
        return CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
    case BLE_PHY_MODE_2M:
        return CCM_MODE_DATARATE_2Mbit << CCM_MODE_DATARATE_Pos;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    case BLE_PHY_MODE_CODED_125KBPS:
#ifdef NRF54L_SERIES
        return CCM_MODE_DATARATE_125Kbit << CCM_MODE_DATARATE_Pos;
#else
        return CCM_MODE_DATARATE_125Kbps << CCM_MODE_DATARATE_Pos;
#endif
    case BLE_PHY_MODE_CODED_500KBPS:
#ifdef NRF54L_SERIES
        return CCM_MODE_DATARATE_500Kbit << CCM_MODE_DATARATE_Pos;
#else
        return CCM_MODE_DATARATE_500Kbps << CCM_MODE_DATARATE_Pos;
#endif
#endif
    }

    assert(0);
    return 0;
#else
    return CCM_MODE_DATARATE_1Mbit << CCM_MODE_DATARATE_Pos;
#endif
}
#endif

static void
ble_phy_end_handling_setup(void)
{
    if (g_ble_phy_data.phy_feature_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
        NRF_RADIO->SHORTS = 0;
    } else if (g_ble_phy_data.tifs_usecs >= BLE_LL_IFS) {
#ifdef NRF54L_SERIES
        NRF_RADIO->SHORTS |= RADIO_SHORTS_PHYEND_DISABLE_Msk;
#else
        NRF_RADIO->SHORTS |= RADIO_SHORTS_END_DISABLE_Msk;
#endif
        nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_DISABLED_Msk);
    } else {
        nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_END_Msk);
    }
};

/**
 * Setup transceiver for receive.
 */
static void
ble_phy_rx_xcvr_setup(void)
{
    uint8_t *dptr;

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];
    dptr += 3;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    if (g_ble_phy_data.phy_encrypted) {
        NRF_RADIO->PACKETPTR = (uint32_t)&g_ble_phy_enc_buf[0];
#ifdef NRF54L_SERIES
        NRF_CCM->IN.PTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->OUT.PTR = (uint32_t)dptr;
        /* TODO: Find replacement for removed registers like this one
         * NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
         */
        NRF_CCM->MODE = CCM_MODE_MACLEN_Pos | CCM_MODE_MODE_Decryption |
                        ble_phy_get_ccm_datarate();
        memcpy((uint8_t *)NRF_CCM->KEY.VALUE, &g_nrf_ccm_data.key, sizeof(g_nrf_ccm_data.key));
        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->EVENTS_END = 0;
        nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_START);
#else
        NRF_CCM->INPTR = (uint32_t)&g_ble_phy_enc_buf[0];
        NRF_CCM->OUTPTR = (uint32_t)dptr;
        NRF_CCM->SCRATCHPTR = (uint32_t)&g_nrf_encrypt_scratchpad[0];
        NRF_CCM->MODE = CCM_MODE_LENGTH_Msk | CCM_MODE_MODE_Decryption |
                                                    ble_phy_get_ccm_datarate();
        NRF_CCM->CNFPTR = (uint32_t)&g_nrf_ccm_data;
        NRF_CCM->SHORTS = 0;
        NRF_CCM->EVENTS_ERROR = 0;
        NRF_CCM->EVENTS_ENDCRYPT = 0;
        nrf_ccm_task_trigger(NRF_CCM, NRF_CCM_TASK_KSGEN);
#endif
        phy_ppi_radio_address_to_ccm_crypt_enable();
    } else {
        NRF_RADIO->PACKETPTR = (uint32_t)dptr;
    }
#else
    NRF_RADIO->PACKETPTR = (uint32_t)dptr;
#endif

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    if (g_ble_phy_data.phy_privacy) {
        NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Enabled;
#ifdef NRF54L_SERIES
        NRF_AAR->IN.PTR = (uint32_t)&g_nrf_irk_list[0];
        /* TODO: Find replacement for NRF_AAR->SCRATCHPTR */
#else
        NRF_AAR->IRKPTR = (uint32_t)&g_nrf_irk_list[0];
        NRF_AAR->SCRATCHPTR = (uint32_t)&g_ble_phy_data.phy_aar_scratch;
#endif
        NRF_AAR->EVENTS_END = 0;
        NRF_AAR->EVENTS_RESOLVED = 0;
        NRF_AAR->EVENTS_NOTRESOLVED = 0;
    } else {
        if (g_ble_phy_data.phy_encrypted == 0) {
            NRF_AAR->ENABLE = AAR_ENABLE_ENABLE_Disabled;
        }
    }
#endif

