apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    /* Turn off trigger TXEN on output compare match and AAR on bcmatch */
    phy_ppi_timer0_compare0_to_radio_txen_disable();
    phy_ppi_timer0_compare0_to_radio_start_disable();
    phy_ppi_radio_bcmatch_to_aar_start_disable();

    /* Reset the rx started flag. Used for the wait for response */
    g_ble_phy_data.phy_rx_started = 0;
    g_ble_phy_data.phy_state = BLE_PHY_STATE_RX;

#if MYNEWT_VAL(BLE_LL_PHY)
    /*
     * On Coded PHY there are CI and TERM1 fields before PDU starts so we need
     * to take this into account when setting up BCC.
     */
    if (g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_125KBPS ||
            g_ble_phy_data.phy_cur_phy_mode == BLE_PHY_MODE_CODED_500KBPS) {
        g_ble_phy_data.phy_bcc_offset = 5;
    } else {
        g_ble_phy_data.phy_bcc_offset = 0;
    }
#else
    g_ble_phy_data.phy_bcc_offset = 0;
#endif

    /* I want to know when 1st byte received (after address) */
    nrf_radio_bcc_set(NRF_RADIO, g_ble_phy_data.phy_bcc + g_ble_phy_data.phy_bcc_offset); /* in bits */
    NRF_RADIO->EVENTS_ADDRESS = 0;
    NRF_RADIO->EVENTS_DEVMATCH = 0;
    NRF_RADIO->EVENTS_BCMATCH = 0;
#ifndef NRF54L_SERIES
    NRF_RADIO->EVENTS_RSSIEND = 0;
#endif
    NRF_RADIO->EVENTS_CRCOK = 0;
    NRF_RADIO->SHORTS = RADIO_SHORTS_READY_START_Msk |
                        RADIO_SHORTS_ADDRESS_BCSTART_Msk |
                        RADIO_SHORTS_ADDRESS_RSSISTART_Msk;
#ifndef NRF54L_SERIES
    NRF_RADIO->SHORTS |= RADIO_SHORTS_DISABLED_RSSISTOP_Msk;
#endif
    nrf_radio_int_enable(NRF_RADIO, RADIO_INTENSET_ADDRESS_Msk);
}

static void
ble_phy_feat_mode_set(uint8_t phy_feat_mode)
{
    g_ble_phy_data.phy_feature_mode = phy_feat_mode;
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING) && !BABBLESIM
    NRF_RADIO->CSTONES.MODE = 0;
    NRF_RADIO->RTT.CONFIG = 0;
#endif
    if (phy_feat_mode == PHY_FEAT_MODE_BLE_LL) {
        /* Configure back the registers */
        NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos) | RADIO_CRCCNF_LEN_Three;
        NRF_RADIO->PCNF0 = NRF_PCNF0;
        NRF_RADIO->PCNF1 = NRF_MAXLEN |
                           (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                           (NRF_BALEN << RADIO_PCNF1_BALEN_Pos) |
                           RADIO_PCNF1_WHITEEN_Msk;

        g_ble_phy_data.phy_bcc = 8;
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
#if !BABBLESIM
        } else if (phy_feat_mode == PHY_FEAT_MODE_BLE_CS_SYNC) {
        /* CS SYNC packet has no PDU or CRC */
        NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos);
        /* CS_SYNC needs only PAYLOAD field, so do not transmit S0, LENGTH and S1 fields. */
        NRF_RADIO->PCNF0 = RADIO_PCNF0_S1INCL_Include << RADIO_PCNF0_S1INCL_Pos;
        /* Disable whitening */
        NRF_RADIO->PCNF1 = (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                           (NRF_BALEN << RADIO_PCNF1_BALEN_Pos);

        g_ble_phy_data.phy_bcc = 0;
//        NRF_RADIO->RTT.CONFIG = RADIO_RTT_CONFIG_EN_Enabled << RADIO_RTT_CONFIG_EN_Pos |
//                                RADIO_RTT_CONFIG_ENFULLAA_Enabled << RADIO_RTT_CONFIG_ENFULLAA_Pos |
//                                RADIO_RTT_CONFIG_ROLE_Reflector << RADIO_RTT_CONFIG_ROLE_Pos |
//                                (256UL) << RADIO_RTT_CONFIG_EFSDELAY_Pos;
    } else if (phy_feat_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
#endif
#endif
    }
}

static uint32_t
ble_phy_transition_anchor_get(uint8_t tifs_anchor, uint8_t phy_state, uint8_t phy_mode)
{
    uint32_t time;

#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    if (g_ble_phy_data.phy_feature_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
        return NRF_TIMER0->CC[2];
    }
#endif

    if (tifs_anchor == PHY_TRANS_ANCHOR_END) {
        /* END timestamp is captured in CC[2] */
        time = NRF_TIMER0->CC[2];

        /* Adjust for delay between EVENT_END and actual TX/RX end time */
        time += (phy_state == BLE_PHY_STATE_TX)
                ? g_ble_phy_t_txenddelay[phy_mode]
                : -g_ble_phy_t_rxenddelay[phy_mode];

    } else {
        /* ADDRESS timestamp is captured in CC[1] */
        time = NRF_TIMER0->CC[1];

        /* Adjust for delay between EVENT_ADDRESS and actual AA time ota */
        time += (phy_state == BLE_PHY_STATE_TX)
                ? g_ble_phy_t_txaddrdelay[phy_mode]
                : -g_ble_phy_t_rxaddrdelay[phy_mode];

        /* Adjust by sync word length to get TX/RX start time */
        time -= ble_ll_pdu_syncword_us(phy_mode);
    }

    return time;
}

static int
ble_transition_to_tx(uint8_t tifs_anchor, uint16_t tifs_usecs, uint8_t phy_state)
{
    uint32_t anchor_time;
    uint32_t radio_time;
    uint32_t start_time;
    bool is_late;
    uint8_t next_phy_mode;
    uint8_t prev_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_RxIdle) {
        nrf_radio_task_trigger(NRF_RADIO, NRF_RADIO_TASK_DISABLE);
        nrf_wait_disabled();
    }

#if MYNEWT_VAL(BLE_LL_PHY)
    ble_phy_mode_apply(g_ble_phy_data.phy_tx_phy_mode);
#endif
    next_phy_mode = g_ble_phy_data.phy_cur_phy_mode;

    anchor_time = ble_phy_transition_anchor_get(tifs_anchor, phy_state, prev_phy_mode);
    start_time = anchor_time + tifs_usecs;
    radio_time = start_time;
    g_ble_phy_data.phy_start_time = start_time;

#if PHY_USE_FEM_PA
    fem_time = anchor_time - MYNEWT_VAL(BLE_FEM_PA_TURN_ON_US);
    nrf_timer_cc_set(NRF_TIMER0, 2, fem_time);
    NRF_TIMER0->EVENTS_COMPARE[2] = 0;
    phy_fem_enable_pa();
#endif

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        /* Adjust for TX rump-up */
        radio_time -= BLE_PHY_T_TXENFAST;
        /* Adjust for delay between EVENT_READY and actual TX start time */
        radio_time -= g_ble_phy_t_txdelay[next_phy_mode];
        phy_ppi_timer0_compare0_to_radio_txen_enable();
    } else {
        /* Fast TX_TX transition */
        BLE_LL_ASSERT(NRF_RADIO->STATE == RADIO_STATE_STATE_TxIdle);
        /* TODO: Adjust for delay between TASK_START and actual TX start time */
        radio_time -= g_ble_phy_t_txdelay[next_phy_mode];
        phy_ppi_timer0_compare0_to_radio_start_enable();
    }

    nrf_timer_cc_set(NRF_TIMER0, 0, radio_time);
    NRF_TIMER0->EVENTS_COMPARE[0] = 0;

