apache/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
static inline uint8_t
ble_phy_get_cur_rx_phy_mode(void)
{
    uint8_t phy;

    phy = g_ble_phy_data.phy_cur_phy_mode;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    /*
     * For Coded PHY mode can be set to either codings since actual coding is
     * set in packet header. However, here we need actual coding of received
     * packet as this determines pipeline delays so need to figure this out
     * using CI field.
     */
    if ((phy == BLE_PHY_MODE_CODED_125KBPS) ||
                                    (phy == BLE_PHY_MODE_CODED_500KBPS)) {
        phy = NRF_RADIO->PDUSTAT & RADIO_PDUSTAT_CISTAT_Msk ?
                                   BLE_PHY_MODE_CODED_500KBPS :
                                   BLE_PHY_MODE_CODED_125KBPS;
    }
#endif

    return phy;
}

static void
ble_phy_rx_end_isr(void)
{
    int rc;
    uint8_t *dptr;
    struct ble_mbuf_hdr *ble_hdr;
    uint8_t crcok;
    uint8_t transition;
    uint16_t tifs_usecs;
    uint8_t feat_mode;

    /* Disable automatic RXEN */
    phy_ppi_timer0_compare0_to_radio_rxen_disable();
    /* Disable automatic RX START */
    phy_ppi_timer0_compare0_to_radio_start_disable();

#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    g_ble_phy_data.rxend_time_ticks = NRF_TIMER0->CC[2] -
            g_ble_phy_t_rxenddelay[g_ble_phy_data.phy_rx_phy_mode];
#endif

    /* Set RSSI and CRC status flag in header */
    ble_hdr = &g_ble_phy_data.rxhdr;
#ifndef NRF54L_SERIES
    assert(NRF_RADIO->EVENTS_RSSIEND != 0);
#endif
    ble_hdr->rxinfo.rssi = (-1 * NRF_RADIO->RSSISAMPLE);

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];
    dptr += 3;

    /* Count PHY crc errors and valid packets */
    crcok = NRF_RADIO->EVENTS_CRCOK;
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    if ((NRF_RADIO->CRCCNF & RADIO_CRCCNF_LEN_Msk) == 0) {
        /* CRC disabled */
    } else
#endif
    if (!crcok) {
        STATS_INC(ble_phy_stats, rx_crc_err);
    } else {
        STATS_INC(ble_phy_stats, rx_valid);
        ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_CRC_OK;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
        if (g_ble_phy_data.phy_encrypted) {
#ifdef NRF54L_SERIES
            while (NRF_CCM->EVENTS_END == 0) {
#else
            while (NRF_CCM->EVENTS_ENDCRYPT == 0) {
#endif
                /* Make sure CCM finished */
            };

            /* Only set MIC failure flag if frame is not zero length */
            if ((dptr[1] != 0) &&
#ifdef NRF54L_SERIES
                (NRF_CCM->MACSTATUS == 0)) {
#else
                (NRF_CCM->MICSTATUS == 0)) {
#endif
                ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_MIC_FAILURE;
            }

            /*
             * XXX: not sure how to deal with this. This should not
             * be a MIC failure but we should not hand it up. I guess
             * this is just some form of rx error and that is how we
             * handle it? For now, just set CRC error flags
             */
            if (NRF_CCM->EVENTS_ERROR) {
                STATS_INC(ble_phy_stats, rx_hw_err);
                ble_hdr->rxinfo.flags &= ~BLE_MBUF_HDR_F_CRC_OK;
            }
        }
#endif
    }

    /*
     * Let's schedule TX now and we will just cancel it after processing RXed
     * packet if we don't need TX.
     *
     * We need this to initiate connection in case AUX_CONNECT_REQ was sent on
     * LE Coded S8. In this case the time we process RXed packet is roughly the
     * same as the limit when we need to have TX scheduled (i.e. TIMER0 and PPI
     * armed) so we may simply miss the slot and set the timer in the past.
     *
     * When TX is scheduled in advance, we may event process packet a bit longer
     * during radio ramp-up - this gives us extra 40 usecs which is more than
     * enough.
     */
    if (g_ble_phy_data.phy_transition == PHY_TRANS_NONE) {
        /* XXX: Should be removed after finding all missing uses of ble_phy_transition_set */
        g_ble_phy_data.phy_transition = PHY_TRANS_TO_TX;
    }

    transition = g_ble_phy_data.phy_transition;
    tifs_usecs = g_ble_phy_data.tifs_usecs,

    ble_phy_transition(transition, g_ble_phy_data.tifs_anchor,
                       tifs_usecs, BLE_PHY_STATE_RX);

    ble_phy_feat_mode_set(g_ble_phy_data.next_phy_feature_mode);

    /* Clear transition related variables here in case they
     * are not overwritten in ble_ll_rx_end.
     */
    ble_phy_transition_set(BLE_PHY_TRANSITION_NONE, 0);

    /*
     * XXX: This is a horrible ugly hack to deal with the RAM S1 byte
     * that is not sent over the air but is present here. Simply move the
     * data pointer to deal with it. Fix this later.
     */
    dptr[2] = dptr[1];
    dptr[1] = dptr[0];
    rc = ble_ll_rx_end(dptr + 1, ble_hdr);
    if (rc < 0) {
        ble_phy_disable();
        return;
    }

    if (g_ble_phy_data.phy_state != BLE_PHY_STATE_IDLE) {
        ble_phy_end_handling_setup();

#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
        if (g_ble_phy_data.phy_feature_mode == PHY_FEAT_MODE_BLE_CS_TONE) {
            ble_phy_end_set(g_ble_phy_data.cs_tone_duration_usecs);
        } else
#endif
        if (transition == BLE_PHY_TRANSITION_TO_RX) {
            ble_phy_wfr_enable(BLE_PHY_WFR_ENABLE_RXRX, 0, g_ble_phy_data.wfr_usecs);
        }
    }
}

static bool
ble_phy_rx_start_isr(void)
{
    int rc;
    uint32_t state;
    uint32_t usecs;
    uint32_t pdu_usecs;
    uint32_t ticks;
    struct ble_mbuf_hdr *ble_hdr;
    uint8_t *dptr;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_PRIVACY)
    int adva_offset;
#endif

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];

    /* Clear events and clear interrupt */
    NRF_RADIO->EVENTS_ADDRESS = 0;
    nrf_radio_int_disable(NRF_RADIO, RADIO_INTENCLR_ADDRESS_Msk);

    /* Clear wfr timer channels */
    phy_ppi_wfr_disable();
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    phy_ppi_timer0_compare3_to_radio_disable_disable();
    phy_ppi_timer0_compare3_to_radio_stop_disable();
#endif

    /* Initialize the ble mbuf header */
    ble_hdr = &g_ble_phy_data.rxhdr;
    ble_hdr->rxinfo.flags = ble_ll_state_get();
    ble_hdr->rxinfo.channel = g_ble_phy_data.phy_chan;
    ble_hdr->rxinfo.handle = 0;
    ble_hdr->rxinfo.phy = ble_phy_get_cur_phy();
    ble_hdr->rxinfo.phy_mode = ble_phy_get_cur_rx_phy_mode();
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LL_EXT_ADV)
    ble_hdr->rxinfo.user_data = NULL;
#endif

